app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `name`) VALUES ('sd', 'qwe')
---
  def create
    p params
    user_parameters = params[:user]
    User.create(email: user_parameters[:email], name: user_parameters[:name])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `email` = 'qwe@qwe.com', `name` = 'abhsk' WHERE `users`.`id` = 1
---
  def update
    user = User.find(params[:id])
    user.update_attributes(user_parameters)